wrk_rps_merged/820
Running 5m test @ http://10.100.237.41:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 743.976ms, rate sampling interval: 1989ms
  Thread calibration: mean lat.: 743.864ms, rate sampling interval: 2308ms
  Thread calibration: mean lat.: 858.589ms, rate sampling interval: 2869ms
  Thread calibration: mean lat.: 762.896ms, rate sampling interval: 2306ms
  Thread calibration: mean lat.: 727.861ms, rate sampling interval: 2121ms
  Thread calibration: mean lat.: 776.356ms, rate sampling interval: 2156ms
  Thread calibration: mean lat.: 790.315ms, rate sampling interval: 2347ms
  Thread calibration: mean lat.: 860.221ms, rate sampling interval: 2682ms
  Thread calibration: mean lat.: 764.094ms, rate sampling interval: 2158ms
  Thread calibration: mean lat.: 829.127ms, rate sampling interval: 2705ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   665.20ms  444.93ms   5.75s    84.58%
    Req/Sec     9.52      1.70    16.00     92.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  576.51ms
 75.000%  769.02ms
 90.000%  980.48ms
 99.000%    2.54s 
 99.900%    3.66s 
 99.990%    4.39s 
 99.999%    5.75s 
100.000%    5.75s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.545     0.000000            1         1.00
     273.151     0.100000         2918         1.11
     370.431     0.200000         5816         1.25
     451.839     0.300000         8702         1.43
     535.551     0.400000        11618         1.67
     576.511     0.500000        14498         2.00
     637.439     0.550000        15961         2.22
     658.431     0.600000        17433         2.50
     681.471     0.650000        18849         2.86
     743.935     0.700000        20315         3.33
     769.023     0.750000        21759         4.00
     828.415     0.775000        22478         4.44
     844.287     0.800000        23211         5.00
     863.231     0.825000        23932         5.71
     887.807     0.850000        24649         6.67
     951.295     0.875000        25378         8.00
     966.143     0.887500        25746         8.89
     980.479     0.900000        26104        10.00
    1073.151     0.912500        26461        11.43
    1256.447     0.925000        26822        13.33
    1427.455     0.937500        27184        16.00
    1527.807     0.943750        27365        17.78
    1630.207     0.950000        27547        20.00
    1677.311     0.956250        27731        22.86
    1771.519     0.962500        27912        26.67
    1850.367     0.968750        28092        32.00
    1871.871     0.971875        28182        35.56
    1938.431     0.975000        28278        40.00
    1965.055     0.978125        28363        45.71
    2030.591     0.981250        28454        53.33
    2158.591     0.984375        28545        64.00
    2260.991     0.985938        28589        71.11
    2361.343     0.987500        28634        80.00
    2445.311     0.989062        28679        91.43
    2559.999     0.990625        28727       106.67
    2699.263     0.992188        28770       128.00
    2756.607     0.992969        28793       142.22
    2781.183     0.993750        28815       160.00
    2848.767     0.994531        28838       182.86
    2932.735     0.995313        28861       213.33
    2963.455     0.996094        28884       256.00
    2992.127     0.996484        28895       284.44
    3069.951     0.996875        28906       320.00
    3233.791     0.997266        28917       365.71
    3338.239     0.997656        28931       426.67
    3430.399     0.998047        28941       512.00
    3434.495     0.998242        28946       568.89
    3534.847     0.998437        28951       640.00
    3565.567     0.998633        28957       731.43
    3598.335     0.998828        28963       853.33
    3661.823     0.999023        28968      1024.00
    3729.407     0.999121        28971      1137.78
    3743.743     0.999219        28974      1280.00
    3796.991     0.999316        28977      1462.86
    3842.047     0.999414        28980      1706.67
    3883.007     0.999512        28982      2048.00
    3938.303     0.999561        28985      2275.56
    3938.303     0.999609        28985      2560.00
    4132.863     0.999658        28987      2925.71
    4276.223     0.999707        28988      3413.33
    4333.567     0.999756        28990      4096.00
    4333.567     0.999780        28990      4551.11
    4341.759     0.999805        28991      5120.00
    4345.855     0.999829        28992      5851.43
    4345.855     0.999854        28992      6826.67
    4386.815     0.999878        28993      8192.00
    4386.815     0.999890        28993      9102.22
    4390.911     0.999902        28994     10240.00
    4390.911     0.999915        28994     11702.86
    4390.911     0.999927        28994     13653.33
    4734.975     0.999939        28995     16384.00
    4734.975     0.999945        28995     18204.44
    4734.975     0.999951        28995     20480.00
    4734.975     0.999957        28995     23405.71
    4734.975     0.999963        28995     27306.67
    5750.783     0.999969        28996     32768.00
    5750.783     1.000000        28996          inf
#[Mean    =      665.202, StdDeviation   =      444.932]
#[Max     =     5746.688, Total count    =        28996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30016 requests in 5.00m, 195.98MB read
Requests/sec:    100.03
Transfer/sec:    668.80KB