wrk_rps_merged/826
Running 5m test @ http://10.103.216.29:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 500.230ms, rate sampling interval: 1655ms
  Thread calibration: mean lat.: 499.957ms, rate sampling interval: 1524ms
  Thread calibration: mean lat.: 544.423ms, rate sampling interval: 1685ms
  Thread calibration: mean lat.: 558.524ms, rate sampling interval: 1690ms
  Thread calibration: mean lat.: 533.650ms, rate sampling interval: 1683ms
  Thread calibration: mean lat.: 532.350ms, rate sampling interval: 1656ms
  Thread calibration: mean lat.: 527.646ms, rate sampling interval: 1653ms
  Thread calibration: mean lat.: 542.667ms, rate sampling interval: 1662ms
  Thread calibration: mean lat.: 541.692ms, rate sampling interval: 1701ms
  Thread calibration: mean lat.: 567.036ms, rate sampling interval: 1680ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   437.96ms  248.69ms   2.51s    75.58%
    Req/Sec     9.51      2.41    18.00     80.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  425.73ms
 75.000%  544.26ms
 90.000%  714.75ms
 99.000%    1.42s 
 99.900%    1.84s 
 99.990%    2.23s 
 99.999%    2.51s 
100.000%    2.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.608     0.000000            1         1.00
     160.255     0.100000         2902         1.11
     249.855     0.200000         5808         1.25
     320.767     0.300000         8705         1.43
     350.463     0.400000        11612         1.67
     425.727     0.500000        14511         2.00
     438.783     0.550000        15955         2.22
     453.887     0.600000        17394         2.50
     518.399     0.650000        18874         2.86
     530.943     0.700000        20288         3.33
     544.255     0.750000        21779         4.00
     555.007     0.775000        22467         4.44
     615.423     0.800000        23212         5.00
     623.103     0.825000        23938         5.71
     633.855     0.850000        24655         6.67
     644.607     0.875000        25368         8.00
     654.847     0.887500        25728         8.89
     714.751     0.900000        26094        10.00
     725.503     0.912500        26451        11.43
     738.303     0.925000        26808        13.33
     756.735     0.937500        27170        16.00
     817.151     0.943750        27353        17.78
     834.559     0.950000        27532        20.00
     847.871     0.956250        27717        22.86
     863.743     0.962500        27898        26.67
     935.935     0.968750        28077        32.00
     948.223     0.971875        28166        35.56
     963.583     0.975000        28258        40.00
    1117.183     0.978125        28348        45.71
    1216.511     0.981250        28441        53.33
    1241.087     0.984375        28529        64.00
    1266.687     0.985938        28575        71.11
    1320.959     0.987500        28619        80.00
    1350.655     0.989062        28665        91.43
    1440.767     0.990625        28710       106.67
    1521.663     0.992188        28755       128.00
    1534.975     0.992969        28777       142.22
    1550.335     0.993750        28799       160.00
    1560.575     0.994531        28822       182.86
    1616.895     0.995313        28845       213.33
    1635.327     0.996094        28867       256.00
    1647.615     0.996484        28880       284.44
    1727.487     0.996875        28890       320.00
    1738.751     0.997266        28902       365.71
    1750.015     0.997656        28913       426.67
    1757.183     0.998047        28924       512.00
    1819.647     0.998242        28930       568.89
    1823.743     0.998437        28935       640.00
    1832.959     0.998633        28941       731.43
    1838.079     0.998828        28947       853.33
    1842.175     0.999023        28952      1024.00
    1845.247     0.999121        28956      1137.78
    1848.319     0.999219        28958      1280.00
    1849.343     0.999316        28961      1462.86
    1854.463     0.999414        28964      1706.67
    1917.951     0.999512        28966      2048.00
    1940.479     0.999561        28968      2275.56
    2011.135     0.999609        28969      2560.00
    2021.375     0.999658        28971      2925.71
    2111.487     0.999707        28972      3413.33
    2115.583     0.999756        28973      4096.00
    2123.775     0.999780        28974      4551.11
    2207.743     0.999805        28975      5120.00
    2209.791     0.999829        28976      5851.43
    2209.791     0.999854        28976      6826.67
    2228.223     0.999878        28977      8192.00
    2228.223     0.999890        28977      9102.22
    2242.559     0.999902        28978     10240.00
    2242.559     0.999915        28978     11702.86
    2242.559     0.999927        28978     13653.33
    2254.847     0.999939        28979     16384.00
    2254.847     0.999945        28979     18204.44
    2254.847     0.999951        28979     20480.00
    2254.847     0.999957        28979     23405.71
    2254.847     0.999963        28979     27306.67
    2510.847     0.999969        28980     32768.00
    2510.847     1.000000        28980          inf
#[Mean    =      437.964, StdDeviation   =      248.687]
#[Max     =     2508.800, Total count    =        28980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30010 requests in 5.00m, 191.85MB read
Requests/sec:    100.02
Transfer/sec:    654.72KB